Configuration/Enums/КонтактыРекрутинговыхСайтов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КонтактыРекрутинговыхСайтов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Whatsapp</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Max</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/InformationRegisters/ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КонтактыРекрутинговыхСайтов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Enums/КонтактыРекрутинговыхСайтов/Ext/ManagerModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Контакт - ПеречислениеСсылка.КонтактыРекрутинговыхСайтов
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтактнойИнформации - Вид контактной информации
Функция ВидКонтактнойИнформацииПоУмолчанию(Контакт) Экспорт
	Результат = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Контакт) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Идентификатор = Идентификатор(Контакт);
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Результат;
	КонецЕсли;
	
	НайденныйВид =
		Справочники.ВидыКонтактнойИнформации.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
		
	Если ОбщегоНазначения.СсылкаСуществует(НайденныйВид) Тогда
		Результат = НайденныйВид;
	Иначе
		НачатьТранзакцию();
		Попытка
			Результат = СоздатьПоУмолчанию(Контакт, НайденныйВид);
			РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ДобавитьНастройку(
				Результат, Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Параметры:
//  Контакт - ПеречислениеСсылка.КонтактыРекрутинговыхСайтов
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтактнойИнформации - Вид контактной информации
Функция ВидКонтактнойИнформации(Контакт) Экспорт
	Возврат РегистрыСведений.ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.ТекущийВидКонтактнойИнформации(Контакт);
КонецФункции

Процедура ЗаполнитьВидРедактированияПоУмолчанию(ПараметрыОбновления = Неопределено) Экспорт
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	СуществующиеВиды = Новый Массив(); // Массив из СправочникСсылка.ВидыКонтактнойИнформации
	Для Каждого КлючИЗначение Из Идентификаторы() Цикл
		НайденныйВид =
			Справочники.ВидыКонтактнойИнформации.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючИЗначение.Значение));
			
		Если ОбщегоНазначения.СсылкаСуществует(НайденныйВид) Тогда
			СуществующиеВиды.Добавить(НайденныйВид);
		КонецЕсли;
	КонецЦикла;
	
	Если СуществующиеВиды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Для Каждого Вид Из СуществующиеВиды Цикл
		Объект = Вид.ПолучитьОбъект();
		
		Если Не ЗначениеЗаполнено(Объект.ВидРедактирования) Тогда
			Объект.ВидРедактирования = "ПолеВвода";
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
		КонецЕсли;
	КонецЦикла;
	
	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  Структура - Идентификаторы:
// * Telegram - Строка - 
// * Whatsapp - Строка - 
// * Max - Строка - 
// * Прочее - Строка - 
Функция Идентификаторы()
	Результат = Новый Структура;
	Результат.Вставить("Telegram", 		"d9539a00-45e3-4095-a18e-ea1b4db33b1d");
	Результат.Вставить("Whatsapp", 		"e2e18a78-7c80-4bfa-8f2d-a8810abc75ab");
	Результат.Вставить("Max", 			"3f179782-66ff-4f09-b1af-8ada1644d347");
	Результат.Вставить("Прочее", 		"89123084-ba00-40fb-9711-80e598b0930e");
	
	Возврат Результат;
КонецФункции

// Параметры:
//  Контакт - ПеречислениеСсылка.КонтактыРекрутинговыхСайтов
// 
// Возвращаемое значение:
//  Строка - Идентификатор
Функция Идентификатор(Контакт)
	Результат = "";
	Идентификаторы = Идентификаторы();
	
	Если Контакт = Telegram Тогда
		Результат = Идентификаторы.Telegram;
	ИначеЕсли Контакт = Whatsapp Тогда
		Результат = Идентификаторы.Whatsapp;
	ИначеЕсли Контакт = Max Тогда
		Результат = Идентификаторы.Max;
	ИначеЕсли Контакт = Прочее Тогда
		Результат = Идентификаторы.Прочее;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Параметры:
//  Контакт - ПеречислениеСсылка.КонтактыРекрутинговыхСайтов
//  Ссылка - СправочникСсылка.ВидыКонтактнойИнформации
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтактнойИнформации
Функция СоздатьПоУмолчанию(Контакт, Ссылка)
	НовыйВид = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
	НовыйВид.ВидРедактирования = "ПолеВвода";
	НовыйВид.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	НовыйВид.Используется = Истина;
	НовыйВид.ВидПоляДругое = "ОднострочноеУзкое";
	НовыйВид.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникЛичныеДанныеКандидатов;
	НовыйВид.ИмяГруппы = "СправочникЛичныеДанныеКандидатов";
	НовыйВид.Наименование = Строка(Контакт);
	НовыйВид.РазрешитьВводНесколькихЗначений = Истина;
	НовыйВид.ИдентификаторДляФормул = Справочники.ВидыКонтактнойИнформации.УникальныйИдентификаторДляФормул(
		НовыйВид.Наименование, НовыйВид.Ссылка, НовыйВид.Родитель);

	НовыйВид.УстановитьСсылкуНового(Ссылка);
	НовыйВид.Записать();
	
	Возврат НовыйВид.Ссылка;
КонецФункции

#КонецОбласти

#КонецЕсли
